//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
Console.WriteLine("Введите количество: ");

int i = 0;

while ( 1 < количество )
{
    i+2;
    Console.Write(i);
}
